
## Plan Result (v3-proxy-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/67517)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4030
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod:14"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"188c4307-16ba-4b76-b972-1ed8fd333651","JobName":"v3-proxy-api_infrastructure_plan_prod","PRNumber":236,"Program":"tfcmt","SHA1":"e9bcbc24c880cef589d95f449755cdc4b9ba069f","Target":"v3-proxy-api-cdk","Vars":{}} -->